<!DOCTYPE html>
<html>
<head>

<title>Hobbies Osmar Higuera</title>

<!-- CSS only -->
<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.2/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-uWxY/CJNBR+1zjPWmfnSnVxwRheevXITnMqoEIeG1LJrdI0GlVs/9cVSyPYXdcSF" crossorigin="anonymous">
<!-- JavaScript Bundle with Popper -->
<script src="https://cdn.jsdelivr.net/npm/bootstrap@5.1.2/dist/js/bootstrap.bundle.min.js" integrity="sha384-kQtW33rZJAHjgefvhyyzcGF3C5TFyBQBA13V1RKPf4uH+bwyzQxZ6CmMZHmNBEfJ" crossorigin="anonymous"></script>
<!-- FontAwesome -->
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.0.0-beta2/css/all.min.css" integrity="sha512-YWzhKL2whUzgiheMoBFwW8CKV4qpHQAEuvilg9FAn5VJUDwKZZxkJNuGM4XkWuk94WCrrwslk8yWNGmY1EduTA==" crossorigin="anonymous" referrerpolicy="no-referrer" />

<!-- Video JS -->
<link rel="stylesheet" href="css/video-js.css">
<script src="js/video.js"></script>
<link href="https://fonts.googleapis.com/css?family=Open+Sans:300,400" rel="stylesheet">
<link rel="stylesheet" href="css/estilos.css">

</head>
<body>
  
	<header>
		<img src="img/encabezado.png" class="img-fluid" alt="...">
		<h1><p class="text-center"> Mis hobbies </p></h1>
	
	</header>
	
<h2><p class="text-center"><i class="fas fa-tv"></i> Series favoritas <i class="fas fa-tv"></i></p></h2>

<p class="text-center" size="28px"><font size=5> Uno de mis hobbies favoritos es ver series, aunque en la actualidad, desde que comenz&oacute; la cuarentena, ya casi no he visto ninguna. Sin embargo, 
mis series favoritas son las que se muestran a continuaci&oacute;n: </font></p>

<div class="card-group">
  <div class="card">
    <img src="img/friends.jpg" class="card-img-top" alt="Friends">
    <div class="card-body">
      <h5 class="card-title">Friends</h5>
      <p class="card-text">Rachel Green (Jennifer Aniston) deja plantado a su novio el d&iacute;a de su boda al comprobar que le gusta m&aacute;s una salsera que su futuro marido.
Rachel, vestida de novia, se encuentra en la cafeter&iacute;a Central Perk con su amiga Monica Geller (Courtney Cox), que est&aacute; acompa&ntilde;ada de Joey Tribbiani (Matt LeBlanc), Phoebe Buffay (Lisa Kudrow), Chandler Bing (Matthew Perry) y Ross Geller (David Schwimmer).
Es el comienzo de una nueva vida para Rachel y sus nuevos amigos.</p>
    </div>
  </div>
  
  <div class="card">
    <img src="img/himym.jpg" class="card-img-top" alt="How I Met Your Mother">
    <div class="card-body">
      <h5 class="card-title">How I Met Your Mother</h5>
      <p class="card-text">En el a&ntilde;o 2030, el arquitecto Ted Mosby (Josh Radnor) decide contarles a sus dos hijos la historia de c&oacute;mo conoci&oacute; a su madre. Por lo tanto, inicia una narraci&oacute;n de recuerdos 
	  recopilados desde el 2005, a&ntilde;o en el que dos de sus mejores amigos, Marshall Eriksen (Jason Segel) y Lily Aldrin (Alyson Hannigan), deciden casarse tras nueve a&ntilde;os de noviazgo. Esa decisi&oacute;n hace que Ted, 
	  soltero empedernido, al igual que su otro mejor amigo Barney Stinson (Neil Patrick Harris), decida encontrar al amor de su vida desesperadamente. De una manera curiosa, aparece en ese instante la reportera canadiense 
	  Robin Scherbatsky (Cobie Smulders), que se convertir&aacute; en una nueva amiga del grupo y parte importante en la vida de Ted. A partir de este hecho, inicia la b&uacute;squeda implacable de una esposa que se 
	  convierta en madre de sus hijos.</p>
    </div>
  </div>
  <div class="card">
    <img src="img/avatar.jpg" class="card-img-top" alt="Avatar">
    <div class="card-body">
      <h5 class="card-title">Avatar: La leyenda de Aang</h5>
      <p class="card-text">Es otra &eacute;poca y otro mundo donde el poder est&aacute; equilibrado entre cuatro naciones: Agua, Tierra, Fuego y Aire. Un grupo de l&iacute;deres de cada naci&oacute;n puede manipular
	  su elemento nativo y se les llama "Maestros", pero en cada generaci&oacute;n hay un "Maestro de Maestros", llamado Avatar, el que puede dominar los cuatro elementos y mantener la armon&iacute;a entre las cuatro naciones. 
	  Ahora, han transcurrido cien a&ntilde;os sin un Avatar, y la Naci&oacute;n del Fuego se encuentra en una batalla para dominar al mundo. Aang, el Avatar perdido, debe completar un entrenamiento en los cuatro elementos
	  para restaurar la paz.</p>
    </div>
  </div>
</div>

<br><br>

<h2><p class="text-center"><i class="fas fa-video"></i></i> Pel&iacute;cula favorita <i class="fas fa-video"></i></i></p></h2>
<p class="text-center" size="28px"><font size=5>Otro hobbie que disfruto mucho es ver pel&iacute;s, en especial de ciencia ficci&oacute;n. Actualmente, mi pel&iacute;cula favorita es la de Spider Man: Into the Spiderverse. </font></p>
<main>
	<div class="contenedor">
		<video class="fm-video video-js vjs-16-9 vjs-big-play-centered" data-setup="{}" controls id="fm-video">
			<source src="video/spiderman.mp4" type="video/mp4" width="1150" height="500">
		</video>
	
		<article>
			<h2>Spider Man: Into the Spiderverse</h2>
			<p>Luego de ser mordido por una ara&ntilde;a radioactiva, el joven Miles Morales desarrolla misteriosos poderes que lo transforman en el Hombre Ara&ntilde;a. Ahora deber&aacute; usar sus nuevas habilidades ante 
			   el malvado Kingpin, un enorme demente que puede abrir portales hacia otros universos.</p><br />
		</article>
	</div>
</main>

	<script>
		var reproductor = videojs('fm-video', {
			fluid: true
		});
	</script>

<br><br>

<h2><p class="text-center"><i class="fas fa-music"></i> Canciones favoritas <i class="fas fa-music"></i></p></h2>
<p class="text-center" size="28px"><font size=5> La mayor parte de mi d&iacute;a estoy escuchando m&uacute;sica, por lo que puedo decir que es mi hobbie principal, y el que m&aacute;s disfruto.</font></p>
<center>
<h6> <p> </p> Daniel Caesar - Best Part (feat. H.E.R.) </h6>

<audio controls>
  <source src="audio/bestpart.mp3" type="audio/mpeg">
  Your browser does not support the audio tag.
</audio>

<h6> <p> </p> Rex Orange County - Sunflower </h6>

<audio controls>
  <source src="audio/sunflower.mp3" type="audio/mpeg">
  Your browser does not support the audio tag.
</audio>
</center>

<br><br>

<h5>Redes sociales</h5>

<nav class="nav flex-column">
  <a class="nav-link" href="https://www.instagram.com/osmarselo" target="_blank">Instagram<i class="fab fa-instagram-square"></i></a>
  <a class="nav-link" href="https://www.twitter.com/osmarselo" target="_blank">Twitter<i class="fab fa-twitter"></i></a>
</nav>

<center><footer>

Osmar Francisco Higuera Mendoza // 357637 // 07/10/2021

</footer></center>

</body>

</html>